Proxecto/app/Models/MenusModel.php

    public function getNombres(){
        return $this->select("id_menu, nombre_menu")->get()->getResultArray();
---
SELECT `id_menu`, `nombre_menu`
FROM `menus`