Proxecto/app/Models/MenusModel.php

     public function getAll(){
        return $this->select("*")->get()->getResultArray();
---
SELECT *
FROM `menus`

    public function getMenu(string $id){
        return $this->select("*")->where("id_menu",$id)->get()->getResultArray()[0];
---
SELECT *
FROM `menus`
WHERE `id_menu` = '1'

    public function getNombres(){
        return $this->select("id_menu, nombre_menu")->where("estado_menu",0)->get()->getResultArray();
---
SELECT `id_menu`, `nombre_menu`
FROM `menus`
WHERE `estado_menu` = 0

    public function getPrecioMenu(string $id){
        return $this->select("precio_menu")->where("id_menu",$id)->get()->getResultArray()[0];
---
SELECT `precio_menu`
FROM `menus`
WHERE `id_menu` = '4'