Proxecto/app/Models/PedidosModel.php

    public function getAll(){
        return $this->select("*")->get()->getResultArray();
---
SELECT *
FROM `pedidos`

    public function isExistPedido(string $id){
        $this->select("*")->where("id_pedido", $id);
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pedidos`

    public function getPedido(string $id){
        return $this->select("*")->where("id_pedido",$id)->get()->getResultArray()[0];
---
SELECT *
FROM `pedidos`
WHERE `id_pedido` = '8'

    public function add(array $_add){
        $this->insert($_add);
---
INSERT INTO `pedidos` (`id_usuario`, `id_menu`, `fecha_recogida`, `hora_recogida`, `estado_pedido`, `cantidad`, `total_pagar`, `comentario`) VALUES ('1', '4', '2023-05-31', '13:17', '0', '3', 48, '')