Proxecto/app/Models/UsuariosModel.php

    public function getAll(){
        return $this->select("*")->get()->getResultArray();
---
SELECT *
FROM `usuarios`