Proxecto/app/Models/UsuariosModel.php

SELECT `id_usuario`, `id_rol`, `nombre_usuario`, `apellidos`, `correo_electronico`, `telefono`, `baja_usuario`
FROM `usuarios`
---
    public function getAll(){
        return $this->select("id_usuario, id_rol, nombre_usuario, apellidos, correo_electronico, telefono, baja_usuario")->get()->getResultArray();

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '39'
---
    public function loadUser(string $id){
            return $this->select("*")->where("id_usuario",$id)->get()->getResultArray();

SELECT *
FROM `usuarios`
WHERE `correo_electronico` = 'admin@admin.com'
---
    public function login(array $array) {
        $pass = array();
        $this->select("*")->where("correo_electronico",$array["correo_electronico"]);
        $this->where("baja_usuario",0);
        if($this->countAllResults() == 1) {
            $user = $this->select("*")->where("correo_electronico",$array["correo_electronico"])->get()->getResultArray()[0];

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '39'
UPDATE `usuarios` SET `nombre_usuario` = 'Camarero', `apellidos` = 'Camarero', `correo_electronico` = 'camarero@piosdrriba.com', `telefono` = '999999998', `contraseña` = '', `id_rol` = '2'
WHERE `id_usuario` = '39'
---
    public function edit(array $_array,string $id){
        $user = $this->select("*")->where("id_usuario",$id)->get()->getResultArray();
        if(count($user) > 0){
            if(!empty($_array["contraseña"])){
                $_array["contraseña"] = password_hash($_array["contraseña"],PASSWORD_DEFAULT);
                $this->set($_array);
                $this->where("id_usuario",$id);
                $this->update();
                return true;
            }else{
                unset($_array["contraseña"]);
                $this->set($_array);
                $this->where("id_usuario",$id);
                $this->update();